/**
 * 
 * @authors Your Name (you@example.org)
 * @date    2017-09-28 14:24:43
 * @version $Id$
 */
$(function(){
     var date=[
 {one:["微信号","日期","姓名","电话","职业规划"],two:["sss111","17-25-55","张三","185525855","查看"]},
  {one:["微信号","日期","姓名","电话","职业规划"],two:["sss111","17-25-55","张三","185525855","查看"]},
 {one:["微信号","日期","姓名","电话","咨询的问题"],two:["sss111","17-25-55","张三","185525855","what444?"]},
 {one:["微信号","日期","姓名","电话","简历"],two:["sss111","17-25-55","张三","185525855","查看"]},
 {one:["微信号","日期","姓名","电话","意向单位/职位"],two:["sss111","17-25-55","张三","185525855","华为/UI设计师"]},
 {one:["微信号","日期","姓名","简历",""],two:["sss111","17-25-55","张三","查看",""]},
  {one:["微信号","日期","姓名","电话",""],two:["sss111","17-25-55","张三","185525855",""]},
 ];
 var datetwo=[
    {one:["微信号","日期","姓名","电话","支付"],two:["sss111","17-25-55","张三","185525855","是"]},
   {one:["微信号","日期","姓名","电话","支付"],two:["sss111","17-25-55","张三","185525855","否"]},
 ];
 var dateshree=[
    {one:["1.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["sss111","17-25-55","张三","185525855","是"]},
    {one:["2.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["sss111","17-25-55","张三","185525855","是"]},
    {one:["3.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["sss111","17-25-55","张三","185525855","是"]},
    {one:["4.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["sss111","17-25-55","张三","185525855","是"]},
    {one:["5.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["sss111","17-25-55","张三","185525855","是"]},
    {one:["6.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["sss111","17-25-55","张三","185525855","是"]},
    {one:["7.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["sss111","17-25-55","张三","185525855","是"]},
    {one:["8.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["sss111","17-25-55","张三","185525855","是"]},
    {one:["9.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["sss111","17-25-55","张三","185525855","是"]},
    {one:["10.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["sss111","17-25-55","张三","185525855","是"]},
    {one:["11.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["sss111","17-25-55","张三","185525855","是"]},

    ]
var datefore=[
    {one:["1.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["2.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["3.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["4.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["5.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["6.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["7.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["8.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["9.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["10.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["11.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    ]
var datefive=[
    {ti:[{one:["1.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["2.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["3.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["4.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["5.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["6.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["7.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["8.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["9.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["10.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["11.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},]},
     {ti:[{one:["1.2222一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["2.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["3.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["4.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["5.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["6.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["7.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["8.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["9.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["10.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["11.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},]},
     {ti:[{one:["1.333一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["2.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["3.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["4.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["5.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["6.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["7.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["8.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["9.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["10.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["11.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},]},
     {ti:[{one:["1.4444一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["2.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["3.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["4.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["5.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["6.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["7.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["8.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["9.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["10.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["11.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},]},
     {ti:[{one:["1.5555一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["2.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["3.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["4.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["5.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["6.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["7.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["8.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["9.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["10.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["11.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},]},
     {ti:[{one:["1.6666一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["2.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["3.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["4.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["5.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["6.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["7.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["8.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["9.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["10.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["11.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},]},
     {ti:[{one:["1.777一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["2.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["3.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["4.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["5.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["6.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["7.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["8.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["9.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["10.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["11.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},]},
     {ti:[{one:["1.8888一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["2.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["3.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["4.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["5.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["6.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["7.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["8.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["9.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["10.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},
    {one:["11.一座大楼发生火灾,老陈逃到了楼顶后,无路可走,便逃到了隔壁的楼顶上,两楼只隔10公分,老陈却摔死了,为什么","A:1111111","B:2222","C:33333","D:5555"],two:["img/gan1.png"]},]}
    ]
var datesix=[
{one:["商品名称","价格","日期","图片"]},
{one:["java开发","100","14-25-55","<img src='img/gan1.png'>"]},
{one:["H5","100","14-25-55","<img src='img/gan2.png'>"]},
{one:["php","100","14-25-55","<img src='img/gan3.png'>"]},
{one:["IOS","100","14-25-55","<img src='img/gan2.png'>"]},
{one:["UI","100","14-25-55","<img src='img/gan1.png'>"]},
{one:["Java","100","14-25-55","<img src='img/gan3.png'>"]},
{one:["Java","100","14-25-55","<img src='img/gan1.png'>"]},
{one:["Java","100","14-25-55","<img src='img/gan1.png'>"]},
]
 $(".listone").empty();
     var fot=$("<footer class='footer'></footer>")
      fot.appendTo($(".listone"))
     var fot1=$("<div class='box'><div class='select'></div></div>")
     var fot3=$("<div class='tit' id='tit'><p class='textss' id='textss'>请选择专业名称</p><span id='san' class='span'></span></div>")
     var font4=$(" <ul class='lists' id='lists'><li>java开发</li><li>软件测试</li><li>WEB前端开发</li><li>UI设计</li><li>产品经理</li><li>嵌入式软件</li><li>嵌入式硬件</li><li>其他</li></ul>")
     fot1.appendTo(fot);
     fot3.appendTo($(".select"));
     font4.appendTo($(".select"));
        var tit = document.getElementById("tit");
        var list = document.getElementById("lists");
        var san = document.getElementById("san");
        var a = 0
        tit.onclick = function(event) { 
            a++;
            if (a%2 == 1) {
                list.style.height="250px";
                san.style.transform="rotate(180deg)";
            }else{
                list.style.height="0px";
                san.style.transform="rotate(0deg)";
            };
        } 
       var leng=$(".footer li").length
        for (var i =0 ;i<leng;i++) {
         $(".footer li").eq(i).click(function(){
                var text = this.innerHTML;
                list.style.height="0px";
                san.style.transform="rotate(0deg)";
                a++;
                document.getElementById("textss").innerHTML = text;
                 $(".listone").empty();
                 var index=$(this).index()
             var cont=$("<div class='lishreete'></div>")
             cont.appendTo($(".listone"))
             for(var s=0;s<datefore.length;s++){
               var cont1=$("<ul class='listul'></ul>");
             var li=$("<li class='li'></li>") 
             cont1.appendTo($(".lishreete"))
             li.appendTo($(cont1))
             for(var i=0;i<5;i++){
               var cont2=$("<div>"+datefive[index].ti[s].one[i]+"</div>"); 
                 cont2.appendTo($(li));
        }
        
         // var sont=$("<img src="+datefore[s].two[0]+">")
         // sont.appendTo($(li))
         var btn=$("<button class='xiubtn'>修改</button><button class='zengbtn'>增加</button><button class='shanbtn'>删除</button>");
         btn.appendTo(cont1)
    }
        function biq(){
        var E = window.wangEditor
        var editor = new E('#editor')
        editor.create();
    }
     $(".lishreete .xiubtn").click(function(){
        show($(this))
    })
    function show(xiu){
        $("#editor").remove();
        $(xiu).parent().after("<div id='editor'></div>")
        biq(); 
        var this1=$(xiu).parent().index();
        // console.log(this1)
        var str=document.getElementsByTagName("p")[0];
        var stc=document.getElementsByClassName("li")[this1];
          str.innerHTML=$(stc).html();
          var str1=$("<button class='quebtn'>确定</button><button class='qubtn'>取消</button>");
          str1.appendTo($("#editor"));
          $(".quebtn").click(function(){
            stc.innerHTML=$(str).html();
            $("#editor").remove();
          })
          $(".qubtn").click(function(){
             $("#editor").remove();
          })

    }
    $(".lishreete .zengbtn").click(function(){
        showone($(this))
    })
    function showone(zeng){
        $("#editor").remove();
        $(zeng).parent().after("<div id='editor'></div>")
        biq(); 
         var str1=$("<button class='quebtn'>确定</button><button class='qubtn'>取消</button>");
          str1.appendTo($("#editor"));
          $(".quebtn").click(function(){
            var str=document.getElementsByTagName("p");
            var leng=str.length;
            var stry=$(str).text()
            if(stry==""){
                alert("请增加内容！")
            }else{
          var cont1=$("<ul class='listul'></ul>"); 
           cont1.appendTo($(".lishreete"))
           var li=$("<li class='li'></li>") 
           li.appendTo($(cont1))
            var btn=$("<button class='xiubtn'>修改</button><button class='zengbtn'>增加</button><button class='shanbtn'>删除</button>");
         btn.appendTo(cont1)
          for(var i=0;i<5;i++){
            var strr=$(str).eq(i).html(); 
             var cont2=$("<div>"+strr+"</div>");
             
             cont2.appendTo($(li));
          }
          $(".lishreete .zengbtn").click(function(){
        showone($(this))
    })
    $(".lishreete .xiubtn").click(function(){
        show($(this))
    })
     $(".lishreete .shanbtn").click(function(){
        showtwo($(this))
    })
            $("#editor").remove();
            }
          
          })
          $(".qubtn").click(function(){
             $("#editor").remove();
          })


    }
 $(".lishreete .shanbtn").click(function(){
        showtwo($(this))
    })
    function showtwo(shan){
    if(document.getElementById('editor')){
        console.log(1)
    }else{
   var str=$("<div class='tan'></div>")
    var str5=$("<div class='tan1'></div>")
    str5.appendTo($(str))
    var str1=$("<div>确定要删除?</div>")
     str1.appendTo($(str5))
    var str2=$("<p></p>")   
    str2.appendTo($(str5))
    var str3=$("<button class='yes'>YES</button>")
    var str4=$("<button class='no'>NO</button>")
     str3.appendTo($(str2))
     str4.appendTo($(str2))
     str.appendTo($(".listone"))
     var index= $(shan).parent().index();
     $(".tan .no").click(function(){
        $(".tan").remove();
     })
     $(".tan .yes").click(function(){
        $(".tan").remove();
        $(".listul").eq(index).remove()
     })
    }
   
        
    }
})
}
})